{
  "id": 823464,
  "page": 1,
  "results": [
    {
      "author": "Manuel São Bento",
      "author_details": {
        "name": "Manuel São Bento",
        "username": "msbreviews",
        "avatar_path": null,
        "rating": 7
      },
      "content": "FULL SPOILER-FREE REVIEW @ https://fandomwire.com/godzilla-x-kong-the-new-empire-review/\r\n\r\n\"Godzilla x Kong: The New Empire is a “more” version of the previous installment. More Hollow Earth, more Titans, more gloriously giant fights filled with fantastic visual effects… and much more nonsense too.\r\n\r\nThrough an openly absurd narrative, Adam Wingard takes the charm and chemistry of his cast to help focus the film’s main spotlight on the titanic protagonists, Godzilla and Kong, delivering two hours of pure, unadulterated entertainment.\r\n\r\nIt won’t convert the most skeptical, but it will certainly solidify the unashamed passion of MonsterVerse fans.\"\r\n\r\nRating: B",
      "created_at": "2024-03-28T18:01:31.827Z",
      "id": "6605b07b3fe797017bcb584b",
      "updated_at": "2024-03-28T18:01:31.973Z",
      "url": "https://www.themoviedb.org/review/6605b07b3fe797017bcb584b"
    },
    {
      "author": "NghiaLuong",
      "author_details": {
        "name": "",
        "username": "NghiaLuong",
        "avatar_path": null,
        "rating": null
      },
      "content": "This is a good movie about the science fiction genre, the scenes are very vivid and have really quality frames to send to viewers. I was very impressed with the screenplay and I'm about to watch the movie one more time.",
      "created_at": "2024-04-02T18:14:35.941Z",
      "id": "660c4b0bda9ef2017d572d0c",
      "updated_at": "2024-04-26T20:08:23.084Z",
      "url": "https://www.themoviedb.org/review/660c4b0bda9ef2017d572d0c"
    },
    {
      "author": "CinemaSerf",
      "author_details": {
        "name": "CinemaSerf",
        "username": "Geronimo1967",
        "avatar_path": "/1kks3YnVkpyQxzw36CObFPvhL5f.jpg",
        "rating": 6
      },
      "content": "It has to get at least three stars because it's got Dan Stevens (and his piercing eyes) in it. Otherwise, this is an entirely derivative and predictable effort that leaves nothing at all to our imagination. A truce has broken out since the last time (2021), with \"Kong\" ruling the roost deep in \"Hollow Earth\"; \"Godzilla\" curled up asleep in the Coliseum and \"Ilene\" (Rebecca Hall) and the troubled \"Jia\" (Kaylee Hottle) keeping an eye on things for \"Monarch\" and mankind. \"Kong\" has a bad tooth so he comes to the humans for help. Fortunately, \"Trapper\" (the aforementioned DS) is a dab hand at grand-scale dentistry but it's while the ape is topside that alarm bells go off. \"Godzilla\" starts marauding again and an undiscovered vortex in the nether world requires investigation by \"Kong\" and his human pals. With \"Bernie\" (Brian Tyree Henry) back in the gang, off they all go to discover that a new menace has arrived, destroyed their monitoring outpost and it is now setting up a battle royal with just about every Titan left on Earth - above or below. Adam Winyard does just about everything on this film, and that shows in a complete lack of objectivity when evaluating this third rate adventure, the banal writing and equally lacklustre acting. It's as plain as the nose on your face why \"Godzilla' - who doesn't feature so much in this - is collecting energy, and when we do eventually get to them, the combat scenes are repetitive and too tightly choreographed. The scale is all over the place too. At times \"Kong\" appears the size of an house, at others he's more like a mouse. The visual effects are put to good use, but Hall just underwhelms, Henry talks way too much and Stevens' busky humour just doesn't hit home at all. I know it's difficult to keep coming up with new ideas for this genre and it must be difficult for the actors to constantly engage with nothing but some greenscreen, but the story is thin and the film reminds you of just about everything from \"Jurassic Park\" to episodes of \"Stargate\". It does need a big screen, though. On television it will be even more forgettable - but I did like the moth.",
      "created_at": "2024-04-04T11:11:37.660Z",
      "id": "660e8ae9149565017dbd77e1",
      "updated_at": "2024-04-04T11:17:24.731Z",
      "url": "https://www.themoviedb.org/review/660e8ae9149565017dbd77e1"
    },
    {
      "author": "r96sk",
      "author_details": {
        "name": "",
        "username": "r96sk",
        "avatar_path": "/mwR7rFHoDcobAx1i61I3skzMW3U.jpg",
        "rating": 5
      },
      "content": "A whole load of nothing!\r\n\r\n<em>'Godzilla × Kong: The New Empire'</em> is not a good movie, in my opinion anyway. It is similar to its predecessor in that sense at least, this is a minute improvement on that 2021 entry mind. It's basically a Kong film though, Godzilla goes missing for large periods. There is less human to be found onscreen which is good to see, but what's added in its place with Kong is just so dull to me.\r\n\r\nThe needless humanising of Kong continues, though this time it's actually done in and around the other monsters because... well, actually I'm not sure why monsters are acting human-like to each other but, eh, the movie, I guess. That Suko young ape character is particularly annoying too, it sounded like a clown horn and looks more belonging to that one Coldplay music video.\r\n\r\nThe whole film feels like if <em>'<a href=\"https://letterboxd.com/films/in/avatar-collection/by/release-earliest/size/large/\" rel=\"nofollow\">Avatar</a>'</em> and the <em>'<a href=\"https://letterboxd.com/films/in/planet-of-the-apes-reboot-collection/by/release-earliest/size/large/\" rel=\"nofollow\">Planet of the Apes</a>'</em> reboots had a baby and that's not a positive. It felt watching that it was also taking bits and pieces from other films too, mind perhaps that's just me reaching? The best scene of it all features the two titular characters in Giza, their bits together in Hollow Earth are decent too but their opponents are incredibly lame.\r\n\r\nCast-wise, it's OK. Rebecca Hall and Kaylee Hottle are as fine as previously, Brian Tyree Henry is marginally improved and Dan Stevens is serviceable. None of the others are all that noteworthy to me, but that actually is a true plus for this production; last time out I wanted less humans and less humans is what we get here.\r\n\r\nMy review kinda reads as if I hate this 2024 release. I do not, there are far worse pictures out there of course. It's just a heap of disappointment. I guess I just want pure, turn-off-your-brain titan carnage from these flicks, which evidently is not what the Monsterverse is necessarily trying to do... that's probably on me.\r\n\r\nCatching up on this franchise has made me want to even more check out the 'proper' Godzilla releases out of Japan, so there is that. As for these American ones, I like <em>'Kong: Skull Island'</em> at least...",
      "created_at": "2024-04-11T23:11:56.480Z",
      "id": "66186e3cbbcae0017c949ee9",
      "updated_at": "2024-04-11T23:11:56.570Z",
      "url": "https://www.themoviedb.org/review/66186e3cbbcae0017c949ee9"
    },
    {
      "author": "MovieGuys",
      "author_details": {
        "name": "",
        "username": "MovieGuys",
        "avatar_path": null,
        "rating": 6
      },
      "content": "Godzilla x Kong is an exposition driven affair, wrapped in CGI eye candy, in an attempt to make the whole bland affair, marginally appetising. \r\n\r\nThe eye candy aspect of this monster action flick is well done. In fact, its flawless and whilst this might evoke \"ooohs and ahhhs\", on the big screen, there's a lot more to any film, than visuals. \r\n\r\nUnlike Godzilla minus One, this Hollywood affair fails to deliver beyond the superficial. Its back story, with a sprinkling of the usual woke fluff, is formulaic, unimaginative and frankly, a little lazy. \r\n\r\nThe results a film whose elaborate exposition, holds you, for a time but equally, its effect quickly dissipates. A little over half way in, I became thoroughly bored and distracted. \r\n\r\nIn summary,  Godzilla x Kong is a simplistic action monster flick propelled by CGI laden exposition. On a big screen its a visually impressive but ultimately, a rather empty experience.",
      "created_at": "2024-05-13T21:45:28.720Z",
      "id": "664289f8d9f11056b45f1de0",
      "updated_at": "2024-05-13T21:45:28.800Z",
      "url": "https://www.themoviedb.org/review/664289f8d9f11056b45f1de0"
    }
  ],
  "total_pages": 1,
  "total_results": 5
}
